Revit 2027 API
ParameterTypeId.DividedSurfacePatternFillMaterial Property
 "Pattern Fill Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DividedSurfacePatternFillMaterial { get; }
Public Shared ReadOnly Property DividedSurfacePatternFillMaterial As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DividedSurfacePatternFillMaterial {
	ForgeTypeId^ get ();
}
static member DividedSurfacePatternFillMaterial : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace